In [15]:
import datetime
import time

import pandas as pd
import seaborn as sns
import cartopy.crs as ccrs
import cartopy.feature as cfeature
import matplotlib.pyplot as plt
from sqlalchemy import create_engine
from sqlalchemy.orm import sessionmaker
import pgpasslib

from querymsc import WorkflowTools

In [2]:
connection_string = "postgresql+psycopg2://nannau@dbmsc.pcic.uvic.ca/msc"

In [16]:
connection_string = "postgresql+psycopg2://nannau@dbmsc.pcic.uvic.ca/msc"
engine = create_engine(connection_string)
Session = sessionmaker(bind=engine)
session = Session()

In [17]:
start_time = datetime.datetime(1990, 1, 1)
end_time = datetime.datetime(2000, 1, 1)

msc = workflow_tools(start_time, end_time, month=1)

In [19]:
hdd = msc.deg_day_below_18_query(session)

In [20]:
start = time.time()
df = pd.read_sql(hdd.statement, engine)
end = time.time()
print((end-start)/60., 'minutes', (end-start), 'seconds')

0.6444256544113159 minutes 38.665539264678955 seconds

In [21]:
df.head()

       hdd   min_date   max_date    sum_1      lat       lon  station_id
0  3116.26 1990-01-01 2000-01-01  55525.0  50.3332 -125.4460         176
1  5399.89 1990-01-01 2000-01-01  46063.0  48.5697  -81.3767        5468
2  6623.72 1990-01-01 2000-01-01  48701.0  58.7667 -111.1170        3610
3  5687.91 1990-01-01 2000-01-01  43608.0  58.6214 -117.1650        3640
4  4587.14 1990-01-01 2000-01-01  51378.0  49.6316 -115.9620        1398